---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalResourceType
source: html/d7b0dd83-bd06-eb2d-cda1-b38db43ac69e.htm
---
# ExternalResourceType Properties

The Guid of GUID-based enum object.